**** Formula syntax for Calc

#+BEGIN_SRC org
| r1/c1(@1/$1) | c2 |        c3 |    c4 sum | c5 sub |
|--------------+----+-----------+-----------+--------|
| r2           |  5 |        10 |        15 |     -5 |
| r3           |  1 |         2 |         3 |     -1 |
| r4           |  3 |         4 |         7 |     -3 |
| r5 mean      |  3 | 5.3333333 | 8.3333333 |    -3. |
#+TBLFM: $4=vsum($2..$3)::@5$2=vmean(@2$2..@4$2)::@5$3=vmean(@2$3..@4$3)::$5=$3-$4
#+END_SRC

#+BEGIN_SRC org
| r1/c1(@1/$1) | c2 |        c3 |    c4 c2*10-c3 |
|--------------+----+-----------+----------------|
| r2           |  5 |        10 |             40 |
#+TBLFM: $4=$2*10-$3
#+END_SRC

| C-c ?   | In a cell, this command will tell you its : line @4, col $5, ref @4$5 or E4, formula: E&=C&-D& |
| C-c }   | Turn on the reference visualization grid                                                       |
| C-c {   | Turn on the debugging mode (Perform C-c C-c on #+TBLFM:... line)                               |
| C-c C-c | Exit the formula editor and store the modified formulas (Issue on the lind #+TBLFM:... )       |
